3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.org
#+title: Concurrency: Mutual Exclusion And Synchronization
#+LATEX: \setlength\parindent{0pt}
#+author: Arnav Gupta

* Concurrency Basics
Arises in 3 different contexts:
1. *multiple applications*: multiprogramming was invented to allow
   processing time to be dynamically shared among a number of
   applications
2. *structured applications*: applications can be programmed as a
   set of concurrent processes
3. *operating system structure*: same structuring advantages
   apply to systems programs as OSs are also a set of processes
   and threads

Key terms:
- *atomic operation*: action that appears to be indivisible; no
  intermediate state or interruption
- *critical section*: section of code that requires access to shared
  resources, cannot be executed by 2+ processes at once
- *deadlock*: situation in which 2+ processes cannot proceed because
  each is waiting for one of the others
- *livelock*: situation in which 2+ processes keep changing state
  without doing any work
- *mutual exclusion*: requirement that when 1 process is in a critical
  section, no other process can be in a critical section accessing
  the same resources
- *race condition*: situation in which multiple threads or processes
  read and write a shared data item and the final result
  depends on their relative timing
- *starvation*: situation in which a runnable process is overlooked
  indefinitely by the scheduler, can be chosen but never is

* Mutual Exclusion: Software Approaches
Software approaches assume mutual exclusion at memory access level:
simultaneous access is serialized.

