3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-19 Mon 19:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Concurrency: Mutual Exclusion And Synchronization</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Concurrency: Mutual Exclusion And Synchronization</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc700e7d">1. Concurrency Basics</a></li>
<li><a href="#org28bfd6f">2. Mutual Exclusion: Software Approaches</a>
<ul>
<li><a href="#orga18e6ad">2.1. Dekker&rsquo;s Algorithm</a></li>
<li><a href="#orgfd5cc72">2.2. Peterson&rsquo;s Algorithm</a></li>
</ul>
</li>
<li><a href="#org44c5f70">3. Principles of Concurrency</a>
<ul>
<li><a href="#org0e64c18">3.1. Operating System Concerns</a></li>
<li><a href="#org26d78e9">3.2. Process Interaction</a></li>
<li><a href="#org17a80d1">3.3. Requirements for Mutual Exclusion</a></li>
</ul>
</li>
<li><a href="#org63ba9b8">4. Mutual Exclusion: Hardware Support</a>
<ul>
<li><a href="#org547dbbf">4.1. Interrupt Disabling</a></li>
<li><a href="#org355b3ed">4.2. Special Machine Instructions</a></li>
</ul>
</li>
<li><a href="#org1ccc2a7">5. Semaphores</a>
<ul>
<li><a href="#org7ff7864">5.1. Producer/Consumer Problem</a></li>
<li><a href="#org0444fe9">5.2. Implementation of Semaphores</a></li>
</ul>
</li>
<li><a href="#orgb21f791">6. Monitors</a>
<ul>
<li><a href="#orgc597d1f">6.1. Monitor with Signal</a></li>
<li><a href="#orgc7aba1b">6.2. Alternate Models of Monitors with Notify and Broadcast</a></li>
</ul>
</li>
<li><a href="#org4f400aa">7. Message Passing</a>
<ul>
<li><a href="#orge1edfdb">7.1. Addressing</a></li>
<li><a href="#org863a390">7.2. Message Format</a></li>
<li><a href="#org071e246">7.3. Mutual Exclusion</a></li>
</ul>
</li>
<li><a href="#orgfcc4871">8. Readers/Writers Problem</a>
<ul>
<li><a href="#orgba12703">8.1. Readers Have Priority</a></li>
<li><a href="#orgf9d0f37">8.2. Writers Have Priority</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc700e7d" class="outline-2">
<h2 id="orgc700e7d"><span class="section-number-2">1.</span> Concurrency Basics</h2>
<div class="outline-text-2" id="text-1">
<p>
Arises in 3 different contexts:
</p>
<ol class="org-ol">
<li><b>multiple applications</b>: multiprogramming was invented to allow
processing time to be dynamically shared among a number of
applications</li>
<li><b>structured applications</b>: applications can be programmed as a
set of concurrent processes</li>
<li><b>operating system structure</b>: same structuring advantages
apply to systems programs as OSs are also a set of processes
and threads</li>
</ol>

<p>
Key terms:
</p>
<ul class="org-ul">
<li><b>atomic operation</b>: action that appears to be indivisible; no
intermediate state or interruption</li>
<li><b>critical section</b>: section of code that requires access to shared
resources, cannot be executed by 2+ processes at once</li>
<li><b>deadlock</b>: situation in which 2+ processes cannot proceed because
each is waiting for one of the others</li>
<li><b>livelock</b>: situation in which 2+ processes keep changing state
without doing any work</li>
<li><b>mutual exclusion</b>: requirement that when 1 process is in a critical
section, no other process can be in a critical section accessing
the same resources</li>
<li><b>race condition</b>: situation in which multiple threads or processes
read and write a shared data item and the final result
depends on their relative timing</li>
<li><b>starvation</b>: situation in which a runnable process is overlooked
indefinitely by the scheduler, can be chosen but never is</li>
</ul>
</div>
</div>
<div id="outline-container-org28bfd6f" class="outline-2">
<h2 id="org28bfd6f"><span class="section-number-2">2.</span> Mutual Exclusion: Software Approaches</h2>
<div class="outline-text-2" id="text-2">
<p>
Software approaches assume mutual exclusion at memory access level:
simultaneous access is serialized.
</p>
</div>
