3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.tex
% Created 2024-04-11 Thu 10:45
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Concurrency: Mutual Exclusion And Synchronization}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Concurrency: Mutual Exclusion And Synchronization},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Concurrency Basics}
\label{sec:org3ffc219}
Arises in 3 different contexts:
\begin{enumerate}
\item \textbf{multiple applications}: multiprogramming was invented to allow
processing time to be dynamically shared among a number of
applications
\item \textbf{structured applications}: applications can be programmed as a
set of concurrent processes
\item \textbf{operating system structure}: same structuring advantages
apply to systems programs as OSs are also a set of processes
and threads
\end{enumerate}

Key terms:
\begin{itemize}
\item \textbf{atomic operation}: action that appears to be indivisible; no
intermediate state or interruption
\item \textbf{critical section}: section of code that requires access to shared
resources, cannot be executed by 2+ processes at once
\item \textbf{deadlock}: situation in which 2+ processes cannot proceed because
each is waiting for one of the others
\item \textbf{livelock}: situation in which 2+ processes keep changing state
without doing any work
\item \textbf{mutual exclusion}: requirement that when 1 process is in a critical
section, no other process can be in a critical section accessing
the same resources
\item \textbf{race condition}: situation in which multiple threads or processes
read and write a shared data item and the final result
depends on their relative timing
\item \textbf{starvation}: situation in which a runnable process is overlooked
indefinitely by the scheduler, can be chosen but never is
\end{itemize}
\section{Mutual Exclusion: Software Approaches}
\label{sec:org08952e0}
Software approaches assume mutual exclusion at memory access level:
simultaneous access is serialized.
