3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.org
** Dekker's Algorithm
First attempt has a ~turn~ variable that has the pid for the
process allowed in the critical section.
- guarantees mutual exclusion but has two drawbacks
  1. processes must strictly alternate, so pace is dictated by
     the slower process
  2. if one process fails, the other is permanently blocked
- done using coroutines (pass execution control back and
  forth)

Second attempt has a bool vector ~flag~ with each index
corresponding to a pid, where ~true~ means the process is in
the critical section.
- does not guarantee mutual exclusion

Third attempt sets flag before checking if other process
in critical section.
- if one process fails inside the critical section,
  the other process is blocked
- if one process fails outside the critical section,
  the other process is not blocked
- can cause deadlock if both processes set flag
  before checking the other's flag

Fourth attempt has each process turn off flag to enter
critical section after turning it on.
- can cause livelock if each process repeatedly turns
  its flags on and off

The correct solution is Dekker's algorithm:
- uses both bool vector ~flag~ and variable ~turn~
- process sets flag to ~true~ before checking
- while checking, if it is not a process's turn,
  it defers to the other process which will flip
  its flag

#+BEGIN_SRC c
boolean flag[2];
int turn;
void P0() {
  while (true) {
    flag[0] = true;
    while (flag[1]) {
      if (turn ==  1) {
        flag[0] = false;
        while (turn == 1);
        flag[0] = true;
      }
    }
    /* critical section */
    turn = 1;
    flag[0] = false;
    /* remainder */
  }
}
void P1() {
  while (true) {
    flag[1] = true;
    while (flag[0]) {
      if (turn ==  0) {
        flag[1] = false;
        while (turn == 0);
        flag[1] = true;
      }
    }
    /* critical section */
    turn = 0;
    flag[1] = false;
    /* remainder */
  }
}
void main() {
  flag[0] = false;
  flag[1] = false;
  turn = 1;
  parbegin(P0, P1);
}
#+END_SRC

