3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.html
<div id="outline-container-orga18e6ad" class="outline-3">
<h3 id="orga18e6ad"><span class="section-number-3">2.1.</span> Dekker&rsquo;s Algorithm</h3>
<div class="outline-text-3" id="text-2-1">
<p>
First attempt has a <code>turn</code> variable that has the pid for the
process allowed in the critical section.
</p>
<ul class="org-ul">
<li>guarantees mutual exclusion but has two drawbacks
<ol class="org-ol">
<li>processes must strictly alternate, so pace is dictated by
the slower process</li>
<li>if one process fails, the other is permanently blocked</li>
</ol></li>
<li>done using coroutines (pass execution control back and
forth)</li>
</ul>

<p>
Second attempt has a bool vector <code>flag</code> with each index
corresponding to a pid, where <code>true</code> means the process is in
the critical section.
</p>
<ul class="org-ul">
<li>does not guarantee mutual exclusion</li>
</ul>

<p>
Third attempt sets flag before checking if other process
in critical section.
</p>
<ul class="org-ul">
<li>if one process fails inside the critical section,
the other process is blocked</li>
<li>if one process fails outside the critical section,
the other process is not blocked</li>
<li>can cause deadlock if both processes set flag
before checking the other&rsquo;s flag</li>
</ul>

<p>
Fourth attempt has each process turn off flag to enter
critical section after turning it on.
</p>
<ul class="org-ul">
<li>can cause livelock if each process repeatedly turns
its flags on and off</li>
</ul>

<p>
The correct solution is Dekker&rsquo;s algorithm:
</p>
<ul class="org-ul">
<li>uses both bool vector <code>flag</code> and variable <code>turn</code></li>
<li>process sets flag to <code>true</code> before checking</li>
<li>while checking, if it is not a process&rsquo;s turn,
it defers to the other process which will flip
its flag</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ECBE7B;">boolean</span> <span style="color: #dcaeea;">flag</span><span style="color: #51afef;">[</span><span style="color: #da8548; font-weight: bold;">2</span><span style="color: #51afef;">]</span>;
<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">turn</span>;
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">P0</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    flag<span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">]</span> = <span style="color: #a9a1e1;">true</span>;
    <span style="color: #51afef;">while</span> <span style="color: #98be65;">(</span>flag<span style="color: #a9a1e1;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">]</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
      <span style="color: #51afef;">if</span> <span style="color: #a9a1e1;">(</span>turn ==  <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">{</span>
        flag<span style="color: #51afef;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #51afef;">]</span> = <span style="color: #a9a1e1;">false</span>;
        <span style="color: #51afef;">while</span> <span style="color: #51afef;">(</span>turn == <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">)</span>;
        flag<span style="color: #51afef;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #51afef;">]</span> = <span style="color: #a9a1e1;">true</span>;
      <span style="color: #a9a1e1;">}</span>
    <span style="color: #98be65;">}</span>
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">critical section</span><span style="color: #5B6268;"> */</span>
    turn = <span style="color: #da8548; font-weight: bold;">1</span>;
    flag<span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">]</span> = <span style="color: #a9a1e1;">false</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">remainder</span><span style="color: #5B6268;"> */</span>
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">P1</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    flag<span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">]</span> = <span style="color: #a9a1e1;">true</span>;
    <span style="color: #51afef;">while</span> <span style="color: #98be65;">(</span>flag<span style="color: #a9a1e1;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #a9a1e1;">]</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
      <span style="color: #51afef;">if</span> <span style="color: #a9a1e1;">(</span>turn ==  <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">{</span>
        flag<span style="color: #51afef;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">]</span> = <span style="color: #a9a1e1;">false</span>;
        <span style="color: #51afef;">while</span> <span style="color: #51afef;">(</span>turn == <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #51afef;">)</span>;
        flag<span style="color: #51afef;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">]</span> = <span style="color: #a9a1e1;">true</span>;
      <span style="color: #a9a1e1;">}</span>
    <span style="color: #98be65;">}</span>
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">critical section</span><span style="color: #5B6268;"> */</span>
    turn = <span style="color: #da8548; font-weight: bold;">0</span>;
    flag<span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">]</span> = <span style="color: #a9a1e1;">false</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">remainder</span><span style="color: #5B6268;"> */</span>
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  flag<span style="color: #c678dd;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #c678dd;">]</span> = <span style="color: #a9a1e1;">false</span>;
  flag<span style="color: #c678dd;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">]</span> = <span style="color: #a9a1e1;">false</span>;
  turn = <span style="color: #da8548; font-weight: bold;">1</span>;
  parbegin<span style="color: #c678dd;">(</span>P0, P1<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
