3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.tex
\subsection{Dekker's Algorithm}
\label{sec:org7a214c1}
First attempt has a \texttt{turn} variable that has the pid for the
process allowed in the critical section.
\begin{itemize}
\item guarantees mutual exclusion but has two drawbacks
\begin{enumerate}
\item processes must strictly alternate, so pace is dictated by
the slower process
\item if one process fails, the other is permanently blocked
\end{enumerate}
\item done using coroutines (pass execution control back and
forth)
\end{itemize}

Second attempt has a bool vector \texttt{flag} with each index
corresponding to a pid, where \texttt{true} means the process is in
the critical section.
\begin{itemize}
\item does not guarantee mutual exclusion
\end{itemize}

Third attempt sets flag before checking if other process
in critical section.
\begin{itemize}
\item if one process fails inside the critical section,
the other process is blocked
\item if one process fails outside the critical section,
the other process is not blocked
\item can cause deadlock if both processes set flag
before checking the other's flag
\end{itemize}

Fourth attempt has each process turn off flag to enter
critical section after turning it on.
\begin{itemize}
\item can cause livelock if each process repeatedly turns
its flags on and off
\end{itemize}

The correct solution is Dekker's algorithm:
\begin{itemize}
\item uses both bool vector \texttt{flag} and variable \texttt{turn}
\item process sets flag to \texttt{true} before checking
\item while checking, if it is not a process's turn,
it defers to the other process which will flip
its flag
\end{itemize}

\begin{verbatim}
boolean flag[2];
int turn;
void P0() {
  while (true) {
    flag[0] = true;
    while (flag[1]) {
      if (turn ==  1) {
        flag[0] = false;
        while (turn == 1);
        flag[0] = true;
      }
    }
    /* critical section */
    turn = 1;
    flag[0] = false;
    /* remainder */
  }
}
void P1() {
  while (true) {
    flag[1] = true;
    while (flag[0]) {
      if (turn ==  0) {
        flag[1] = false;
        while (turn == 0);
        flag[1] = true;
      }
    }
    /* critical section */
    turn = 0;
    flag[1] = false;
    /* remainder */
  }
}
void main() {
  flag[0] = false;
  flag[1] = false;
  turn = 1;
  parbegin(P0, P1);
}
\end{verbatim}
