3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.org
** Peterson's Algorithm
A simpler algorithm that uses ~turn~ to resolve
simultaneity conflicts.

#+BEGIN_SRC c
boolean flag[2];
int turn;
void P0() {
  while (true) {
    flag[0] = true;
    turn = 1;
    while (flag[1] && turn == 1);
    /* critical section */
    flag[0] = false;
    /* remainder */
  }
}
void P1() {
  while (true) {
    flag[1] = true;
    turn = 0;
    while (flag[0] && turn == 0);
    /* critical section */
    turn = 0;
    flag[1] = false;
    /* remainder */
  }
}
void main() {
  flag[0] = false;
  flag[1] = false;
  parbegin(P0, P1);
}
#+END_SRC
* Principles of Concurrency
In a multiprocessor sysmte, it is possible not only
to interleave the execution of multiple processes
but also to overlap them.

Difficulties with interleaving and overlapping:
1. sharing global resources is risky (read/write
   race conditions)
2. difficult for OS to optimally manage resource
   allocation
3. difficult to locate programming errors (less
   reproducable)

Sharing main memory permits efficient and close
interaction among processes, but can lead to problems:
- if one process updates a global variable and is
  interrupted, another process may alter the variable
  before the first process can use its value

Necessary to protect shared global variables by
controlling the code that accesses the variable.

** Operating System Concerns
Concerns are:
1. OS must be able to keep track of processes
2. OS must allocate and deallocate resources for each
   active process (processor time, memory, files,
   IO devices)
3. OS must protect data and physical resources of each
   process against unintended interference by other
   processes
4. functioning of a process and its output must be
   independent of the relative speed of execution

