3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.html
<div id="outline-container-orgfd5cc72" class="outline-3">
<h3 id="orgfd5cc72"><span class="section-number-3">2.2.</span> Peterson&rsquo;s Algorithm</h3>
<div class="outline-text-3" id="text-2-2">
<p>
A simpler algorithm that uses <code>turn</code> to resolve
simultaneity conflicts.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ECBE7B;">boolean</span> <span style="color: #dcaeea;">flag</span><span style="color: #51afef;">[</span><span style="color: #da8548; font-weight: bold;">2</span><span style="color: #51afef;">]</span>;
<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">turn</span>;
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">P0</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    flag<span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">]</span> = <span style="color: #a9a1e1;">true</span>;
    turn = <span style="color: #da8548; font-weight: bold;">1</span>;
    <span style="color: #51afef;">while</span> <span style="color: #98be65;">(</span>flag<span style="color: #a9a1e1;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">]</span> &amp;&amp; turn == <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">critical section</span><span style="color: #5B6268;"> */</span>
    flag<span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">]</span> = <span style="color: #a9a1e1;">false</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">remainder</span><span style="color: #5B6268;"> */</span>
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">P1</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    flag<span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">]</span> = <span style="color: #a9a1e1;">true</span>;
    turn = <span style="color: #da8548; font-weight: bold;">0</span>;
    <span style="color: #51afef;">while</span> <span style="color: #98be65;">(</span>flag<span style="color: #a9a1e1;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #a9a1e1;">]</span> &amp;&amp; turn == <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">)</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">critical section</span><span style="color: #5B6268;"> */</span>
    turn = <span style="color: #da8548; font-weight: bold;">0</span>;
    flag<span style="color: #98be65;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">]</span> = <span style="color: #a9a1e1;">false</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">remainder</span><span style="color: #5B6268;"> */</span>
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  flag<span style="color: #c678dd;">[</span><span style="color: #da8548; font-weight: bold;">0</span><span style="color: #c678dd;">]</span> = <span style="color: #a9a1e1;">false</span>;
  flag<span style="color: #c678dd;">[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">]</span> = <span style="color: #a9a1e1;">false</span>;
  parbegin<span style="color: #c678dd;">(</span>P0, P1<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org44c5f70" class="outline-2">
<h2 id="org44c5f70"><span class="section-number-2">3.</span> Principles of Concurrency</h2>
<div class="outline-text-2" id="text-3">
<p>
In a multiprocessor sysmte, it is possible not only
to interleave the execution of multiple processes
but also to overlap them.
</p>

<p>
Difficulties with interleaving and overlapping:
</p>
<ol class="org-ol">
<li>sharing global resources is risky (read/write
race conditions)</li>
<li>difficult for OS to optimally manage resource
allocation</li>
<li>difficult to locate programming errors (less
reproducable)</li>
</ol>

<p>
Sharing main memory permits efficient and close
interaction among processes, but can lead to problems:
</p>
<ul class="org-ul">
<li>if one process updates a global variable and is
interrupted, another process may alter the variable
before the first process can use its value</li>
</ul>

<p>
Necessary to protect shared global variables by
controlling the code that accesses the variable.
</p>
</div>
<div id="outline-container-org0e64c18" class="outline-3">
<h3 id="org0e64c18"><span class="section-number-3">3.1.</span> Operating System Concerns</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Concerns are:
</p>
<ol class="org-ol">
<li>OS must be able to keep track of processes</li>
<li>OS must allocate and deallocate resources for each
active process (processor time, memory, files,
IO devices)</li>
<li>OS must protect data and physical resources of each
process against unintended interference by other
processes</li>
<li>functioning of a process and its output must be
independent of the relative speed of execution</li>
</ol>
</div>
</div>
