3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.tex
\subsection{Peterson's Algorithm}
\label{sec:org5cdb63c}
A simpler algorithm that uses \texttt{turn} to resolve
simultaneity conflicts.

\begin{verbatim}
boolean flag[2];
int turn;
void P0() {
  while (true) {
    flag[0] = true;
    turn = 1;
    while (flag[1] && turn == 1);
    /* critical section */
    flag[0] = false;
    /* remainder */
  }
}
void P1() {
  while (true) {
    flag[1] = true;
    turn = 0;
    while (flag[0] && turn == 0);
    /* critical section */
    turn = 0;
    flag[1] = false;
    /* remainder */
  }
}
void main() {
  flag[0] = false;
  flag[1] = false;
  parbegin(P0, P1);
}
\end{verbatim}
\section{Principles of Concurrency}
\label{sec:orgf6bcdb7}
In a multiprocessor sysmte, it is possible not only
to interleave the execution of multiple processes
but also to overlap them.

Difficulties with interleaving and overlapping:
\begin{enumerate}
\item sharing global resources is risky (read/write
race conditions)
\item difficult for OS to optimally manage resource
allocation
\item difficult to locate programming errors (less
reproducable)
\end{enumerate}

Sharing main memory permits efficient and close
interaction among processes, but can lead to problems:
\begin{itemize}
\item if one process updates a global variable and is
interrupted, another process may alter the variable
before the first process can use its value
\end{itemize}

Necessary to protect shared global variables by
controlling the code that accesses the variable.
\subsection{Operating System Concerns}
\label{sec:orgbec41be}
Concerns are:
\begin{enumerate}
\item OS must be able to keep track of processes
\item OS must allocate and deallocate resources for each
active process (processor time, memory, files,
IO devices)
\item OS must protect data and physical resources of each
process against unintended interference by other
processes
\item functioning of a process and its output must be
independent of the relative speed of execution
\end{enumerate}
