3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.org
** Process Interaction
 For processes unaware of each other:
 - OS must be concerned about competition for resources
 - results of one process independent of the action of others
 - timing of process may be affected
 - potential problems are mutual exclusion, deadlock of
   a renewable resource, starvation

For processes indirectly aware of each other:
- exhibit cooperation by sharing
- results of one process may depend on information obtained
  from others
- timing of process may be affected
- potential problems are mutual exclusion, deadlock of
  a renewable resource, starvation, data coherence

For processes directly aware of each other:
- exhibit cooperation by communication
- results of one process may depend on information obtained
  from others
- timing of process may be affected
- potential problems are deadlock of
  a consumable resource, starvation

If competition exists:
- each process should leave the state of any resource that
  it uses unaffected
- since a process must wait to use a resource, it will be
  slowed down or may never get access to it

Problems that must be solved for competition are:
1. *Mutual exclusion*: ensuring only one program using the critical
   resource in the critical section at a time
2. *Deadlock*: processes exist a loop waiting on other processes
3. *Starvation*: process is indefinitely denied access to a
   resource, even without deadlock

Processes themselves must express the requirement for mutual exclusoin,
with support from the OS to follow this.

If cooperation by sharing exists:
- processes must cooperate to ensure shared data is properly managed
- control mechanisms must ensure the integrity of shared data

If cooperation by communication exists:
- processes must synchronize various activities through messages
- deadlock and starvation can occur, through awaiting communication
  from other processes

** Requirements for Mutual Exclusion
1. *Enforcement*: only one process at a time allowed in the
   critical section for a resource
2. *No Interference*: a process that halts in its noncritical section
   must do so without interfering with other processes
3. *No Deadlock or Starvation*
4. *No Unnecessary Delay*: a process must not be delayed access to a
   critical section when there is no other process using it
5. *No Assumptions*: no assumptions made about relative process
   speeds or number of processors
6. *Finite Time*: a process remains inside its critical section
   for a finite time only

Main mechanisms for Mutual Exclusion:
- software with Dekker's algorithm (slow)
- special hardware instructions
- support in the OS or a programming language

* Mutual Exclusion: Hardware Support
** Interrupt Disabling
Disabling interrupts guarantees mutual exclusion for a uniprocessor
system.

Costs of interrupt disabling:
- efficiency is degraded since there is limited ability to
  interleave processes.
- does not work for multiprocessor architecture, since a process
  on another processor could invalidate mutual exclusion

