3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.html
<div id="outline-container-org26d78e9" class="outline-3">
<h3 id="org26d78e9"><span class="section-number-3">3.2.</span> Process Interaction</h3>
<div class="outline-text-3" id="text-3-2">
<p>
For processes unaware of each other:
</p>
<ul class="org-ul">
<li>OS must be concerned about competition for resources</li>
<li>results of one process independent of the action of others</li>
<li>timing of process may be affected</li>
<li>potential problems are mutual exclusion, deadlock of
a renewable resource, starvation</li>
</ul>

<p>
For processes indirectly aware of each other:
</p>
<ul class="org-ul">
<li>exhibit cooperation by sharing</li>
<li>results of one process may depend on information obtained
from others</li>
<li>timing of process may be affected</li>
<li>potential problems are mutual exclusion, deadlock of
a renewable resource, starvation, data coherence</li>
</ul>

<p>
For processes directly aware of each other:
</p>
<ul class="org-ul">
<li>exhibit cooperation by communication</li>
<li>results of one process may depend on information obtained
from others</li>
<li>timing of process may be affected</li>
<li>potential problems are deadlock of
a consumable resource, starvation</li>
</ul>

<p>
If competition exists:
</p>
<ul class="org-ul">
<li>each process should leave the state of any resource that
it uses unaffected</li>
<li>since a process must wait to use a resource, it will be
slowed down or may never get access to it</li>
</ul>

<p>
Problems that must be solved for competition are:
</p>
<ol class="org-ol">
<li><b>Mutual exclusion</b>: ensuring only one program using the critical
resource in the critical section at a time</li>
<li><b>Deadlock</b>: processes exist a loop waiting on other processes</li>
<li><b>Starvation</b>: process is indefinitely denied access to a
resource, even without deadlock</li>
</ol>

<p>
Processes themselves must express the requirement for mutual exclusoin,
with support from the OS to follow this.
</p>

<p>
If cooperation by sharing exists:
</p>
<ul class="org-ul">
<li>processes must cooperate to ensure shared data is properly managed</li>
<li>control mechanisms must ensure the integrity of shared data</li>
</ul>

<p>
If cooperation by communication exists:
</p>
<ul class="org-ul">
<li>processes must synchronize various activities through messages</li>
<li>deadlock and starvation can occur, through awaiting communication
from other processes</li>
</ul>
</div>
</div>
<div id="outline-container-org17a80d1" class="outline-3">
<h3 id="org17a80d1"><span class="section-number-3">3.3.</span> Requirements for Mutual Exclusion</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li><b>Enforcement</b>: only one process at a time allowed in the
critical section for a resource</li>
<li><b>No Interference</b>: a process that halts in its noncritical section
must do so without interfering with other processes</li>
<li><b>No Deadlock or Starvation</b></li>
<li><b>No Unnecessary Delay</b>: a process must not be delayed access to a
critical section when there is no other process using it</li>
<li><b>No Assumptions</b>: no assumptions made about relative process
speeds or number of processors</li>
<li><b>Finite Time</b>: a process remains inside its critical section
for a finite time only</li>
</ol>

<p>
Main mechanisms for Mutual Exclusion:
</p>
<ul class="org-ul">
<li>software with Dekker&rsquo;s algorithm (slow)</li>
<li>special hardware instructions</li>
<li>support in the OS or a programming language</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org63ba9b8" class="outline-2">
<h2 id="org63ba9b8"><span class="section-number-2">4.</span> Mutual Exclusion: Hardware Support</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org547dbbf" class="outline-3">
<h3 id="org547dbbf"><span class="section-number-3">4.1.</span> Interrupt Disabling</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Disabling interrupts guarantees mutual exclusion for a uniprocessor
system.
</p>

<p>
Costs of interrupt disabling:
</p>
<ul class="org-ul">
<li>efficiency is degraded since there is limited ability to
interleave processes.</li>
<li>does not work for multiprocessor architecture, since a process
on another processor could invalidate mutual exclusion</li>
</ul>
</div>
</div>
