3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.tex
\subsection{Process Interaction}
\label{sec:org4f4b492}
For processes unaware of each other:
\begin{itemize}
\item OS must be concerned about competition for resources
\item results of one process independent of the action of others
\item timing of process may be affected
\item potential problems are mutual exclusion, deadlock of
a renewable resource, starvation
\end{itemize}

For processes indirectly aware of each other:
\begin{itemize}
\item exhibit cooperation by sharing
\item results of one process may depend on information obtained
from others
\item timing of process may be affected
\item potential problems are mutual exclusion, deadlock of
a renewable resource, starvation, data coherence
\end{itemize}

For processes directly aware of each other:
\begin{itemize}
\item exhibit cooperation by communication
\item results of one process may depend on information obtained
from others
\item timing of process may be affected
\item potential problems are deadlock of
a consumable resource, starvation
\end{itemize}

If competition exists:
\begin{itemize}
\item each process should leave the state of any resource that
it uses unaffected
\item since a process must wait to use a resource, it will be
slowed down or may never get access to it
\end{itemize}

Problems that must be solved for competition are:
\begin{enumerate}
\item \textbf{Mutual exclusion}: ensuring only one program using the critical
resource in the critical section at a time
\item \textbf{Deadlock}: processes exist a loop waiting on other processes
\item \textbf{Starvation}: process is indefinitely denied access to a
resource, even without deadlock
\end{enumerate}

Processes themselves must express the requirement for mutual exclusoin,
with support from the OS to follow this.

If cooperation by sharing exists:
\begin{itemize}
\item processes must cooperate to ensure shared data is properly managed
\item control mechanisms must ensure the integrity of shared data
\end{itemize}

If cooperation by communication exists:
\begin{itemize}
\item processes must synchronize various activities through messages
\item deadlock and starvation can occur, through awaiting communication
from other processes
\end{itemize}
\subsection{Requirements for Mutual Exclusion}
\label{sec:orgd1c0458}
\begin{enumerate}
\item \textbf{Enforcement}: only one process at a time allowed in the
critical section for a resource
\item \textbf{No Interference}: a process that halts in its noncritical section
must do so without interfering with other processes
\item \textbf{No Deadlock or Starvation}
\item \textbf{No Unnecessary Delay}: a process must not be delayed access to a
critical section when there is no other process using it
\item \textbf{No Assumptions}: no assumptions made about relative process
speeds or number of processors
\item \textbf{Finite Time}: a process remains inside its critical section
for a finite time only
\end{enumerate}

Main mechanisms for Mutual Exclusion:
\begin{itemize}
\item software with Dekker's algorithm (slow)
\item special hardware instructions
\item support in the OS or a programming language
\end{itemize}
\section{Mutual Exclusion: Hardware Support}
\label{sec:orgf504b74}
\subsection{Interrupt Disabling}
\label{sec:org6c76f34}
Disabling interrupts guarantees mutual exclusion for a uniprocessor
system.

Costs of interrupt disabling:
\begin{itemize}
\item efficiency is degraded since there is limited ability to
interleave processes.
\item does not work for multiprocessor architecture, since a process
on another processor could invalidate mutual exclusion
\end{itemize}
