3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.org
** Special Machine Instructions
Special instructions carry out two actions atomically
during one instruction fetch cycle.

Compare&Swap instruction (carried out atomically)
- ~testval~ is compared to memory location
  - if equal then a swap occurs with ~newval~
- returns either the old value or whether or not the swap occurred

#+BEGIN_SRC c
const int n = 5;
int bolt;
void P(int i) {
  while (true) {
    while (compare_and_swap(bolt, 0, 1) == 1);
    /* critical section */
    bolt = 0;
    /* remainder */
  }
}
void main() {
  bolt = 0;
  parbegin(P(1), P(2), ..., P(n));
}
#+END_SRC

Exchange instruction (carried out atomically)
- exchanges contents of register with that of memory location

#+BEGIN_SRC c
const int n = 5;
int bolt;
void P(int i) {
  while (true) {
    int keyi = 1;
    do (exchange(&keyi, &bolt))
         while (keyi != 0);
    /* critical section */
    bolt = 0;
    /* remainder */
  }
}
void main() {
  bolt = 0;
  parbegin(P(1), P(2), ..., P(n));
}
#+END_SRC

Advantages of machine-instruction approach:
- applicable to any number of processes for both uniprocessor
  and multiprocessor
- simple and easy to verify
- can be used to support multiple critical sections, each
  defined by its own variable

Disadvantages of machine-instruction approach:
- busy waiting: process waiting for access to a critical section
  consumes processor
- starvation possible: when a process leaves a critical section
  and more than one process is waiting, some process could never
  be chosen
- deadlock possible: higher priority processes could end up
  waiting on lower priority processes inside critical sections

