3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.html
<div id="outline-container-org355b3ed" class="outline-3">
<h3 id="org355b3ed"><span class="section-number-3">4.2.</span> Special Machine Instructions</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Special instructions carry out two actions atomically
during one instruction fetch cycle.
</p>

<p>
Compare&amp;Swap instruction (carried out atomically)
</p>
<ul class="org-ul">
<li><code>testval</code> is compared to memory location
<ul class="org-ul">
<li>if equal then a swap occurs with <code>newval</code></li>
</ul></li>
<li>returns either the old value or whether or not the swap occurred</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">n</span> = <span style="color: #da8548; font-weight: bold;">5</span>;
<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">bolt</span>;
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">P</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    <span style="color: #51afef;">while</span> <span style="color: #98be65;">(</span>compare_and_swap<span style="color: #a9a1e1;">(</span>bolt, <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #a9a1e1;">)</span> == <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">critical section</span><span style="color: #5B6268;"> */</span>
    bolt = <span style="color: #da8548; font-weight: bold;">0</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">remainder</span><span style="color: #5B6268;"> */</span>
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  bolt = <span style="color: #da8548; font-weight: bold;">0</span>;
  parbegin<span style="color: #c678dd;">(</span>P<span style="color: #98be65;">(</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span>, P<span style="color: #98be65;">(</span><span style="color: #da8548; font-weight: bold;">2</span><span style="color: #98be65;">)</span>, ..., P<span style="color: #98be65;">(</span>n<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Exchange instruction (carried out atomically)
</p>
<ul class="org-ul">
<li>exchanges contents of register with that of memory location</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">n</span> = <span style="color: #da8548; font-weight: bold;">5</span>;
<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">bolt</span>;
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">P</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">keyi</span> = <span style="color: #da8548; font-weight: bold;">1</span>;
    <span style="color: #51afef;">do</span> <span style="color: #98be65;">(</span>exchange<span style="color: #a9a1e1;">(</span>&amp;keyi, &amp;bolt<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
         <span style="color: #51afef;">while</span> <span style="color: #98be65;">(</span>keyi != <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">)</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">critical section</span><span style="color: #5B6268;"> */</span>
    bolt = <span style="color: #da8548; font-weight: bold;">0</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">remainder</span><span style="color: #5B6268;"> */</span>
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  bolt = <span style="color: #da8548; font-weight: bold;">0</span>;
  parbegin<span style="color: #c678dd;">(</span>P<span style="color: #98be65;">(</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span>, P<span style="color: #98be65;">(</span><span style="color: #da8548; font-weight: bold;">2</span><span style="color: #98be65;">)</span>, ..., P<span style="color: #98be65;">(</span>n<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Advantages of machine-instruction approach:
</p>
<ul class="org-ul">
<li>applicable to any number of processes for both uniprocessor
and multiprocessor</li>
<li>simple and easy to verify</li>
<li>can be used to support multiple critical sections, each
defined by its own variable</li>
</ul>

<p>
Disadvantages of machine-instruction approach:
</p>
<ul class="org-ul">
<li>busy waiting: process waiting for access to a critical section
consumes processor</li>
<li>starvation possible: when a process leaves a critical section
and more than one process is waiting, some process could never
be chosen</li>
<li>deadlock possible: higher priority processes could end up
waiting on lower priority processes inside critical sections</li>
</ul>
</div>
</div>
</div>
