3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.tex
\subsection{Special Machine Instructions}
\label{sec:orgf3be3ef}
Special instructions carry out two actions atomically
during one instruction fetch cycle.

Compare\&Swap instruction (carried out atomically)
\begin{itemize}
\item \texttt{testval} is compared to memory location
\begin{itemize}
\item if equal then a swap occurs with \texttt{newval}
\end{itemize}
\item returns either the old value or whether or not the swap occurred
\end{itemize}

\begin{verbatim}
const int n = 5;
int bolt;
void P(int i) {
  while (true) {
    while (compare_and_swap(bolt, 0, 1) == 1);
    /* critical section */
    bolt = 0;
    /* remainder */
  }
}
void main() {
  bolt = 0;
  parbegin(P(1), P(2), ..., P(n));
}
\end{verbatim}

Exchange instruction (carried out atomically)
\begin{itemize}
\item exchanges contents of register with that of memory location
\end{itemize}

\begin{verbatim}
const int n = 5;
int bolt;
void P(int i) {
  while (true) {
    int keyi = 1;
    do (exchange(&keyi, &bolt))
         while (keyi != 0);
    /* critical section */
    bolt = 0;
    /* remainder */
  }
}
void main() {
  bolt = 0;
  parbegin(P(1), P(2), ..., P(n));
}
\end{verbatim}

Advantages of machine-instruction approach:
\begin{itemize}
\item applicable to any number of processes for both uniprocessor
and multiprocessor
\item simple and easy to verify
\item can be used to support multiple critical sections, each
defined by its own variable
\end{itemize}

Disadvantages of machine-instruction approach:
\begin{itemize}
\item busy waiting: process waiting for access to a critical section
consumes processor
\item starvation possible: when a process leaves a critical section
and more than one process is waiting, some process could never
be chosen
\item deadlock possible: higher priority processes could end up
waiting on lower priority processes inside critical sections
\end{itemize}
