3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.org
* Semaphores
Common concurrency mechanisms:
- *semaphore*: integer value used for signaling, with atomic
  operations of initialize, decrement, and increment where
  decrement can block a process and increment can unblock a
  process
- *binary semaphore*: semaphore that takes on only 0 and 1
- *mutex*: similar to binary semaphore but the process that
  locks a mutex must unlock it
- *condition variable*: data type used to block a process
  or thread until a condition is true
- *monitor*: programming language construct to encapsulate
  variables, critical sections, and initialization code
  in one data type, where it may only be accessed inside
  critical sections by one process
- *event flags*: memory word used as a synchronization
  mechanism with bits representing events that must be
  waited on
- *messages*: means for two processes to exchange info,
  possibly for synchronization
- *spinlocks*: mutual exclusion mechanism in which a
  process

Two or more processes can cooperate by means of simple signals.

For a semaphore ~s~:
- to transmit a signal, a process executes ~semSignal(s)~
- to receive a signal, a process executes ~semWait(s)~,
  which suspends the process until a signal is transmitted

Semaphore is an integer variable with only 3 operations defined:
1. initialized to nonnegative integer value
2. ~semWait~ decrements the semaphore value, if it becomes negative
   the process executing ~semWait~ is blocked, otherwise it
   continues execution
3. ~semSignal~ increments the semaphore value, if it is less than
   or equal to zero, a process blocked by ~semWait~ is
   unblocked

Consequences of semaphore definition:
1. no way to know before ~semWait~ whether it will block
2. after a process increments a semaphore and another
   process wakes up, both processes run concurrently
3. when calling ~semSignal~, the number of unblocked
   processes may be 0 or 1

Operations on binary semaphore are:
1. initialized to 0 or 1
2. ~semWaitB~ checks the semaphore value, if 0 then the
   process executing ~semWaitB~ is blocked, if 1, then
   the value is changed to 0 and the process continues
3. ~semSignalB~ checks if value is 0 (processes blocked),
   if so then one blocked process is unblocked, if no
   processes blocked the value is set to 1

Mutex is a programming flag to grab and release an object:
- mutex locks (set to 0) when non-shareable data acquired or
  processing started that cannot be performed elsewhere
- mutex unlocks when the data is no longer needed or the
  routine is finished

Semaphores use a queue to hold processes waiting on the
semaphore:
- strong semaphores use FIFO for release, guarantee
  freedom from starvation
- weak semaphores do not specify the order of release,
  no guarantee of freedom from starvation

