3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.html
<div id="outline-container-org1ccc2a7" class="outline-2">
<h2 id="org1ccc2a7"><span class="section-number-2">5.</span> Semaphores</h2>
<div class="outline-text-2" id="text-5">
<p>
Common concurrency mechanisms:
</p>
<ul class="org-ul">
<li><b>semaphore</b>: integer value used for signaling, with atomic
operations of initialize, decrement, and increment where
decrement can block a process and increment can unblock a
process</li>
<li><b>binary semaphore</b>: semaphore that takes on only 0 and 1</li>
<li><b>mutex</b>: similar to binary semaphore but the process that
locks a mutex must unlock it</li>
<li><b>condition variable</b>: data type used to block a process
or thread until a condition is true</li>
<li><b>monitor</b>: programming language construct to encapsulate
variables, critical sections, and initialization code
in one data type, where it may only be accessed inside
critical sections by one process</li>
<li><b>event flags</b>: memory word used as a synchronization
mechanism with bits representing events that must be
waited on</li>
<li><b>messages</b>: means for two processes to exchange info,
possibly for synchronization</li>
<li><b>spinlocks</b>: mutual exclusion mechanism in which a
process</li>
</ul>

<p>
Two or more processes can cooperate by means of simple signals.
</p>

<p>
For a semaphore <code>s</code>:
</p>
<ul class="org-ul">
<li>to transmit a signal, a process executes <code>semSignal(s)</code></li>
<li>to receive a signal, a process executes <code>semWait(s)</code>,
which suspends the process until a signal is transmitted</li>
</ul>

<p>
Semaphore is an integer variable with only 3 operations defined:
</p>
<ol class="org-ol">
<li>initialized to nonnegative integer value</li>
<li><code>semWait</code> decrements the semaphore value, if it becomes negative
the process executing <code>semWait</code> is blocked, otherwise it
continues execution</li>
<li><code>semSignal</code> increments the semaphore value, if it is less than
or equal to zero, a process blocked by <code>semWait</code> is
unblocked</li>
</ol>

<p>
Consequences of semaphore definition:
</p>
<ol class="org-ol">
<li>no way to know before <code>semWait</code> whether it will block</li>
<li>after a process increments a semaphore and another
process wakes up, both processes run concurrently</li>
<li>when calling <code>semSignal</code>, the number of unblocked
processes may be 0 or 1</li>
</ol>

<p>
Operations on binary semaphore are:
</p>
<ol class="org-ol">
<li>initialized to 0 or 1</li>
<li><code>semWaitB</code> checks the semaphore value, if 0 then the
process executing <code>semWaitB</code> is blocked, if 1, then
the value is changed to 0 and the process continues</li>
<li><code>semSignalB</code> checks if value is 0 (processes blocked),
if so then one blocked process is unblocked, if no
processes blocked the value is set to 1</li>
</ol>

<p>
Mutex is a programming flag to grab and release an object:
</p>
<ul class="org-ul">
<li>mutex locks (set to 0) when non-shareable data acquired or
processing started that cannot be performed elsewhere</li>
<li>mutex unlocks when the data is no longer needed or the
routine is finished</li>
</ul>

<p>
Semaphores use a queue to hold processes waiting on the
semaphore:
</p>
<ul class="org-ul">
<li>strong semaphores use FIFO for release, guarantee
freedom from starvation</li>
<li>weak semaphores do not specify the order of release,
no guarantee of freedom from starvation</li>
</ul>
</div>
