3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.tex
\section{Semaphores}
\label{sec:org2d17d57}
Common concurrency mechanisms:
\begin{itemize}
\item \textbf{semaphore}: integer value used for signaling, with atomic
operations of initialize, decrement, and increment where
decrement can block a process and increment can unblock a
process
\item \textbf{binary semaphore}: semaphore that takes on only 0 and 1
\item \textbf{mutex}: similar to binary semaphore but the process that
locks a mutex must unlock it
\item \textbf{condition variable}: data type used to block a process
or thread until a condition is true
\item \textbf{monitor}: programming language construct to encapsulate
variables, critical sections, and initialization code
in one data type, where it may only be accessed inside
critical sections by one process
\item \textbf{event flags}: memory word used as a synchronization
mechanism with bits representing events that must be
waited on
\item \textbf{messages}: means for two processes to exchange info,
possibly for synchronization
\item \textbf{spinlocks}: mutual exclusion mechanism in which a
process
\end{itemize}

Two or more processes can cooperate by means of simple signals.

For a semaphore \texttt{s}:
\begin{itemize}
\item to transmit a signal, a process executes \texttt{semSignal(s)}
\item to receive a signal, a process executes \texttt{semWait(s)},
which suspends the process until a signal is transmitted
\end{itemize}

Semaphore is an integer variable with only 3 operations defined:
\begin{enumerate}
\item initialized to nonnegative integer value
\item \texttt{semWait} decrements the semaphore value, if it becomes negative
the process executing \texttt{semWait} is blocked, otherwise it
continues execution
\item \texttt{semSignal} increments the semaphore value, if it is less than
or equal to zero, a process blocked by \texttt{semWait} is
unblocked
\end{enumerate}

Consequences of semaphore definition:
\begin{enumerate}
\item no way to know before \texttt{semWait} whether it will block
\item after a process increments a semaphore and another
process wakes up, both processes run concurrently
\item when calling \texttt{semSignal}, the number of unblocked
processes may be 0 or 1
\end{enumerate}

Operations on binary semaphore are:
\begin{enumerate}
\item initialized to 0 or 1
\item \texttt{semWaitB} checks the semaphore value, if 0 then the
process executing \texttt{semWaitB} is blocked, if 1, then
the value is changed to 0 and the process continues
\item \texttt{semSignalB} checks if value is 0 (processes blocked),
if so then one blocked process is unblocked, if no
processes blocked the value is set to 1
\end{enumerate}

Mutex is a programming flag to grab and release an object:
\begin{itemize}
\item mutex locks (set to 0) when non-shareable data acquired or
processing started that cannot be performed elsewhere
\item mutex unlocks when the data is no longer needed or the
routine is finished
\end{itemize}

Semaphores use a queue to hold processes waiting on the
semaphore:
\begin{itemize}
\item strong semaphores use FIFO for release, guarantee
freedom from starvation
\item weak semaphores do not specify the order of release,
no guarantee of freedom from starvation
\end{itemize}
