3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.org
** Producer/Consumer Problem
General statement of problem:
- one or more producers generating some type of data
  and placing into buffer
- single consumer takes items out of buffer one at
  a time
- system is to be constrained to prevent the overlap
  of buffer operations (only one agent accessing the
  buffer at a time)

Order of semaphore operations can sometimes matter,
especially for ~semWait~ where there is potential
for deadlock.

Infinite-buffer producer/consumer problem with binary
semaphores

#+BEGIN_SRC c
int n;
binary_semaphore s = 1, delay = 0;
void producer() {
  while (true) {
    produce();
    semWaitB(s);
    append();
    n++;
    if (n == 1) semSignalB(delay);
    semSignalB(s);
  }
}
void consumer() {
  int m;
  semWaitB(delay);
  while (true) {
    semWaitB(s);
    take();
    n--;
    m = n;
    semSignalB(s);
    consume();
    if (m == 0) semWaitB(delay);
  }
}
void main() {
  n = 0;
  parbegin(producer, consumer);
}
#+END_SRC

Infinite-buffer producer/consumer problem with semaphores
#+BEGIN_SRC c
semaphore n = 0, s = 1;
void producer() {
  while (true) {
    produce();
    semWait(s);
    append();
    semSignal(s);
    semSignal(n);
  }
}
void consumer() {
  while (true) {
    semWait(n);
    semWait(s);
    take();
    semSignal(s);
    consume();
  }
}
void main() {
  parbegin(producer, consumer);
}
#+END_SRC

For a finite buffer, it can be treated as circular
with pointer values expressed module the buffer size.
Block occurs on:
- insert in full buffer for producer
- remove from empty buffer for consumer
Unblock occurs on:
- item inserted for consumer
- item removed for producer

Finite-buffer producer/consumer problem with semaphores
#+BEGIN_SRC c
const int sizeofbuffer = /* buffer size */;
semaphore s = 1, n = 0, e = sizeofbuffer;
void producer() {
  while (true) {
    produce();
    semWait(e);
    semWait(s);
    append();
    semSignal(s);
    semSignal(n);
  }
}
void consumer() {
  while (true) {
    semWait(n);
    semWait(s);
    take();
    semSignal(s);
    semSignal(e);
    consume();
  }
}
void main() {
  parbegin(producer, consumer);
}
#+END_SRC

** Implementation of Semaphores
Semaphores must be implemented as atomic primitives;
only one process at a time may manipulate a
semaphore with either ~semWait~ or ~semSignal~.

Can be done with:
- hardware or firmware
- software schemes (Dekker's, Peterson's)
- hardware-supported schemes for mutual exclusion
  - can be done with ~compare_and_swap~ with a flag or by
    inhibiting interrupts

* Monitors
May be difficult to produce a correct program using semaphores.
