3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.html
<div id="outline-container-org7ff7864" class="outline-3">
<h3 id="org7ff7864"><span class="section-number-3">5.1.</span> Producer/Consumer Problem</h3>
<div class="outline-text-3" id="text-5-1">
<p>
General statement of problem:
</p>
<ul class="org-ul">
<li>one or more producers generating some type of data
and placing into buffer</li>
<li>single consumer takes items out of buffer one at
a time</li>
<li>system is to be constrained to prevent the overlap
of buffer operations (only one agent accessing the
buffer at a time)</li>
</ul>

<p>
Order of semaphore operations can sometimes matter,
especially for <code>semWait</code> where there is potential
for deadlock.
</p>

<p>
Infinite-buffer producer/consumer problem with binary
semaphores
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">n</span>;
<span style="color: #ECBE7B;">binary_semaphore</span> <span style="color: #dcaeea;">s</span> = <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">delay</span> = <span style="color: #da8548; font-weight: bold;">0</span>;
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">producer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    produce<span style="color: #98be65;">()</span>;
    semWaitB<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    append<span style="color: #98be65;">()</span>;
    n++;
    <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>n == <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span> semSignalB<span style="color: #98be65;">(</span>delay<span style="color: #98be65;">)</span>;
    semSignalB<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">consumer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">m</span>;
  semWaitB<span style="color: #c678dd;">(</span>delay<span style="color: #c678dd;">)</span>;
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    semWaitB<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    take<span style="color: #98be65;">()</span>;
    n--;
    m = n;
    semSignalB<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    consume<span style="color: #98be65;">()</span>;
    <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>m == <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">)</span> semWaitB<span style="color: #98be65;">(</span>delay<span style="color: #98be65;">)</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  n = <span style="color: #da8548; font-weight: bold;">0</span>;
  parbegin<span style="color: #c678dd;">(</span>producer, consumer<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Infinite-buffer producer/consumer problem with semaphores
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ECBE7B;">semaphore</span> <span style="color: #dcaeea;">n</span> = <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #dcaeea;">s</span> = <span style="color: #da8548; font-weight: bold;">1</span>;
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">producer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    produce<span style="color: #98be65;">()</span>;
    semWait<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    append<span style="color: #98be65;">()</span>;
    semSignal<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    semSignal<span style="color: #98be65;">(</span>n<span style="color: #98be65;">)</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">consumer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    semWait<span style="color: #98be65;">(</span>n<span style="color: #98be65;">)</span>;
    semWait<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    take<span style="color: #98be65;">()</span>;
    semSignal<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    consume<span style="color: #98be65;">()</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  parbegin<span style="color: #c678dd;">(</span>producer, consumer<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
For a finite buffer, it can be treated as circular
with pointer values expressed module the buffer size.
Block occurs on:
</p>
<ul class="org-ul">
<li>insert in full buffer for producer</li>
<li>remove from empty buffer for consumer</li>
</ul>
<p>
Unblock occurs on:
</p>
<ul class="org-ul">
<li>item inserted for consumer</li>
<li>item removed for producer</li>
</ul>

<p>
Finite-buffer producer/consumer problem with semaphores
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">sizeofbuffer</span> = <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">buffer size</span><span style="color: #5B6268;"> */</span>;
<span style="color: #ECBE7B;">semaphore</span> <span style="color: #dcaeea;">s</span> = <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">n</span> = <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #dcaeea;">e</span> = sizeofbuffer;
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">producer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    produce<span style="color: #98be65;">()</span>;
    semWait<span style="color: #98be65;">(</span>e<span style="color: #98be65;">)</span>;
    semWait<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    append<span style="color: #98be65;">()</span>;
    semSignal<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    semSignal<span style="color: #98be65;">(</span>n<span style="color: #98be65;">)</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">consumer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    semWait<span style="color: #98be65;">(</span>n<span style="color: #98be65;">)</span>;
    semWait<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    take<span style="color: #98be65;">()</span>;
    semSignal<span style="color: #98be65;">(</span>s<span style="color: #98be65;">)</span>;
    semSignal<span style="color: #98be65;">(</span>e<span style="color: #98be65;">)</span>;
    consume<span style="color: #98be65;">()</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  parbegin<span style="color: #c678dd;">(</span>producer, consumer<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0444fe9" class="outline-3">
<h3 id="org0444fe9"><span class="section-number-3">5.2.</span> Implementation of Semaphores</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Semaphores must be implemented as atomic primitives;
only one process at a time may manipulate a
semaphore with either <code>semWait</code> or <code>semSignal</code>.
</p>

<p>
Can be done with:
</p>
<ul class="org-ul">
<li>hardware or firmware</li>
<li>software schemes (Dekker&rsquo;s, Peterson&rsquo;s)</li>
<li>hardware-supported schemes for mutual exclusion
<ul class="org-ul">
<li>can be done with <code>compare_and_swap</code> with a flag or by
inhibiting interrupts</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb21f791" class="outline-2">
<h2 id="orgb21f791"><span class="section-number-2">6.</span> Monitors</h2>
<div class="outline-text-2" id="text-6">
<p>
May be difficult to produce a correct program using semaphores.
</p>
</div>
