3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.tex
\subsection{Producer/Consumer Problem}
\label{sec:org394ee82}
General statement of problem:
\begin{itemize}
\item one or more producers generating some type of data
and placing into buffer
\item single consumer takes items out of buffer one at
a time
\item system is to be constrained to prevent the overlap
of buffer operations (only one agent accessing the
buffer at a time)
\end{itemize}

Order of semaphore operations can sometimes matter,
especially for \texttt{semWait} where there is potential
for deadlock.

Infinite-buffer producer/consumer problem with binary
semaphores

\begin{verbatim}
int n;
binary_semaphore s = 1, delay = 0;
void producer() {
  while (true) {
    produce();
    semWaitB(s);
    append();
    n++;
    if (n == 1) semSignalB(delay);
    semSignalB(s);
  }
}
void consumer() {
  int m;
  semWaitB(delay);
  while (true) {
    semWaitB(s);
    take();
    n--;
    m = n;
    semSignalB(s);
    consume();
    if (m == 0) semWaitB(delay);
  }
}
void main() {
  n = 0;
  parbegin(producer, consumer);
}
\end{verbatim}

Infinite-buffer producer/consumer problem with semaphores
\begin{verbatim}
semaphore n = 0, s = 1;
void producer() {
  while (true) {
    produce();
    semWait(s);
    append();
    semSignal(s);
    semSignal(n);
  }
}
void consumer() {
  while (true) {
    semWait(n);
    semWait(s);
    take();
    semSignal(s);
    consume();
  }
}
void main() {
  parbegin(producer, consumer);
}
\end{verbatim}

For a finite buffer, it can be treated as circular
with pointer values expressed module the buffer size.
Block occurs on:
\begin{itemize}
\item insert in full buffer for producer
\item remove from empty buffer for consumer
\end{itemize}
Unblock occurs on:
\begin{itemize}
\item item inserted for consumer
\item item removed for producer
\end{itemize}

Finite-buffer producer/consumer problem with semaphores
\begin{verbatim}
const int sizeofbuffer = /* buffer size */;
semaphore s = 1, n = 0, e = sizeofbuffer;
void producer() {
  while (true) {
    produce();
    semWait(e);
    semWait(s);
    append();
    semSignal(s);
    semSignal(n);
  }
}
void consumer() {
  while (true) {
    semWait(n);
    semWait(s);
    take();
    semSignal(s);
    semSignal(e);
    consume();
  }
}
void main() {
  parbegin(producer, consumer);
}
\end{verbatim}
\subsection{Implementation of Semaphores}
\label{sec:org9ef2086}
Semaphores must be implemented as atomic primitives;
only one process at a time may manipulate a
semaphore with either \texttt{semWait} or \texttt{semSignal}.

Can be done with:
\begin{itemize}
\item hardware or firmware
\item software schemes (Dekker's, Peterson's)
\item hardware-supported schemes for mutual exclusion
\begin{itemize}
\item can be done with \texttt{compare\_and\_swap} with a flag or by
inhibiting interrupts
\end{itemize}
\end{itemize}
\section{Monitors}
\label{sec:org38c8770}
May be difficult to produce a correct program using semaphores.
