3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.org
** Monitor with Signal
Monitor: a software module consisting of one or more procedures,
an initialization sequence, and local data

Chief chracteristics are:
1. local data variables are only accessible only by the monitor's
   procedures and not by any external procedure
2. a process enters the monitor by invoking one of its procedures
3. only one process may be executing in the monitor at a time,
   any other processes that have invoked the monitor are blocked,
   waiting for the monitor to become available

Monitors support synchronization using conditional variables
contained within the monitor and accessible only within the monitor.

Condvars operated on by two functions:
- ~cwait(c)~: suspend execution of the calling process on
  condition ~c~, monitor is now available for use by another process
- ~csignal(c)~: resume execution of some process blocked after a ~cwait~
  on the same condition:
  - if there are multiple such processes, choose one
  - if none, do nothing
Different from semaphores as any signals that tasks aren't waiting on
are lost.

#+BEGIN_SRC c
monitor boundedbuffer;
char buffer[N];
int nextin, nextout;
int count;
cond notfull, notempty;

void append(char x) {
  if (count == N) cwait(notfull);
  buffer[nextin] = x;
  nextin = (nextin + 1) % N;
  count++;
  csignal(notempty);
}

void take(char x) {
  if (count == 0) cwait(notempty);
  x = buffer[nextout];
  nextout = (nextout + 1) % N;
  count--;
  csignal(notfull);
}

{
  nextin = 0; nextout = 0; count = 0;
}
void producer() {
  char x;
  while (true) {
    produce();
    append();
  }
}
void consumer() {
  char x;
  while (true) {
    take();
    consume();
  }
}
void main() {
  parbegin(producer, consumer);
}
#+END_SRC

** Alternate Models of Monitors with Notify and Broadcast
Currently, a process issuing the ~csignal~ must either immediately
exit the monitor or be blocked on the monitor, which has 2
drawbacks:
1. if the process issuing the ~csignal~ has not finished with the
   monitor, two additional process switches are required
2. process scheduling associated with a signal must be reliable,
   no other process can interrupt this switching

Bounded-buffer Monitor Code for Mesa Monitor
#+BEGIN_SRC c
void append(char x) {
  while (count == N) cwait(notfull);
  buffer[nextin] = x;
  nextin = (nextin + 1) % N;
  count++;
  cnotify(notempty);
}

void take(char x) {
  while (count == 0) cwait(notempty);
  x = buffer[nextout];
  nextout = (nextout + 1) % N;
  count--;
  cnotify(notfull);
}
#+END_SRC
~cnotify~ differs in that the condition queue is notified, but
the signalling process continues to execute.
~cbroadcast~ can also cause all processes waiting on a condition
to be placed into a ready state.

Mesa monitor less error prone and more modular than usual
Hoare monitor.

