3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.html
<div id="outline-container-orgc597d1f" class="outline-3">
<h3 id="orgc597d1f"><span class="section-number-3">6.1.</span> Monitor with Signal</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Monitor: a software module consisting of one or more procedures,
an initialization sequence, and local data
</p>

<p>
Chief chracteristics are:
</p>
<ol class="org-ol">
<li>local data variables are only accessible only by the monitor&rsquo;s
procedures and not by any external procedure</li>
<li>a process enters the monitor by invoking one of its procedures</li>
<li>only one process may be executing in the monitor at a time,
any other processes that have invoked the monitor are blocked,
waiting for the monitor to become available</li>
</ol>

<p>
Monitors support synchronization using conditional variables
contained within the monitor and accessible only within the monitor.
</p>

<p>
Condvars operated on by two functions:
</p>
<ul class="org-ul">
<li><code>cwait(c)</code>: suspend execution of the calling process on
condition <code>c</code>, monitor is now available for use by another process</li>
<li><code>csignal(c)</code>: resume execution of some process blocked after a <code>cwait</code>
on the same condition:
<ul class="org-ul">
<li>if there are multiple such processes, choose one</li>
<li>if none, do nothing</li>
</ul></li>
</ul>
<p>
Different from semaphores as any signals that tasks aren&rsquo;t waiting on
are lost.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ECBE7B;">monitor</span> <span style="color: #dcaeea;">boundedbuffer</span>;
<span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">buffer</span><span style="color: #51afef;">[</span>N<span style="color: #51afef;">]</span>;
<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">nextin</span>, <span style="color: #dcaeea;">nextout</span>;
<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">count</span>;
<span style="color: #ECBE7B;">cond</span> <span style="color: #dcaeea;">notfull</span>, <span style="color: #dcaeea;">notempty</span>;

<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">append</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">x</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>count == N<span style="color: #c678dd;">)</span> cwait<span style="color: #c678dd;">(</span>notfull<span style="color: #c678dd;">)</span>;
  buffer<span style="color: #c678dd;">[</span>nextin<span style="color: #c678dd;">]</span> = x;
  nextin = <span style="color: #c678dd;">(</span>nextin + <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">)</span> % N;
  count++;
  csignal<span style="color: #c678dd;">(</span>notempty<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>

<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">take</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">x</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>count == <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #c678dd;">)</span> cwait<span style="color: #c678dd;">(</span>notempty<span style="color: #c678dd;">)</span>;
  x = buffer<span style="color: #c678dd;">[</span>nextout<span style="color: #c678dd;">]</span>;
  nextout = <span style="color: #c678dd;">(</span>nextout + <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">)</span> % N;
  count--;
  csignal<span style="color: #c678dd;">(</span>notfull<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">{</span>
  nextin = <span style="color: #da8548; font-weight: bold;">0</span>; nextout = <span style="color: #da8548; font-weight: bold;">0</span>; count = <span style="color: #da8548; font-weight: bold;">0</span>;
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">producer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">x</span>;
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    produce<span style="color: #98be65;">()</span>;
    append<span style="color: #98be65;">()</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">consumer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">x</span>;
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    take<span style="color: #98be65;">()</span>;
    consume<span style="color: #98be65;">()</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  parbegin<span style="color: #c678dd;">(</span>producer, consumer<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc7aba1b" class="outline-3">
<h3 id="orgc7aba1b"><span class="section-number-3">6.2.</span> Alternate Models of Monitors with Notify and Broadcast</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Currently, a process issuing the <code>csignal</code> must either immediately
exit the monitor or be blocked on the monitor, which has 2
drawbacks:
</p>
<ol class="org-ol">
<li>if the process issuing the <code>csignal</code> has not finished with the
monitor, two additional process switches are required</li>
<li>process scheduling associated with a signal must be reliable,
no other process can interrupt this switching</li>
</ol>

<p>
Bounded-buffer Monitor Code for Mesa Monitor
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">append</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">x</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span>count == N<span style="color: #c678dd;">)</span> cwait<span style="color: #c678dd;">(</span>notfull<span style="color: #c678dd;">)</span>;
  buffer<span style="color: #c678dd;">[</span>nextin<span style="color: #c678dd;">]</span> = x;
  nextin = <span style="color: #c678dd;">(</span>nextin + <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">)</span> % N;
  count++;
  cnotify<span style="color: #c678dd;">(</span>notempty<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>

<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">take</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">char</span> <span style="color: #dcaeea;">x</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span>count == <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #c678dd;">)</span> cwait<span style="color: #c678dd;">(</span>notempty<span style="color: #c678dd;">)</span>;
  x = buffer<span style="color: #c678dd;">[</span>nextout<span style="color: #c678dd;">]</span>;
  nextout = <span style="color: #c678dd;">(</span>nextout + <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">)</span> % N;
  count--;
  cnotify<span style="color: #c678dd;">(</span>notfull<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
<p>
<code>cnotify</code> differs in that the condition queue is notified, but
the signalling process continues to execute.
<code>cbroadcast</code> can also cause all processes waiting on a condition
to be placed into a ready state.
</p>

<p>
Mesa monitor less error prone and more modular than usual
Hoare monitor.
</p>
</div>
</div>
</div>
