3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.org
* Message Passing
When processes interact, must ensure synchronization and communication.
Can be done with message passing, which has 2 primitives:
- ~send(destination, message);~
- ~receive(source, message);~

Sender and receiver can be blocking or nonblocking, of which there are
3 common combinations
1. *blocking send, blocking receive*: both sender and receiver blocked
   until message is delivered, allows for tight synchronization
2. *nonblocking send, blocking receive*: sender may continue but
   receiver is blocked until message arrives
3. *nonblocking send, nonblocking receive*: neither party must wait

Nonblocking send is most natural since a sender can then send
multiple different messages.
Blocking receive is most natural since receivers generally expect
information before proceeding.

** Addressing
With direct addressing
- the ~send~ primitive includes a specific identifier
of the destination process.
- the ~receive~ primitive either:
  - requires that the process explicitly designate a sending process
  - uses implicit addressing: the source possesses a value returned
    when the receive has bene performed

With indirect addressing
- messages are sent to queue that holds messages, called mailbox
- decoupling sender and receiver allows for more flexibility in
  use of messages
- relationship between senders and receivers can be:
  - one-to-one: private communication between two processes
  - many-to-one: client-server interaction, creates port
  - one-to-many: broadcasting to set of processes
  - many-to-many: multiple server processes to provide
    concurrent service to multiple clients
- mailboxes owned by creating process (ex. port)

** Message Format
Message typically divided into header and body.
Header contains:
- message type
- destination ID
- source ID
- message length
- control information

Body contains message contents.

Messages can be queued based on priority.

** Mutual Exclusion
Mutual Exclusion using Messages
#+BEGIN_SRC c
const int n = /* number of processes */;
void P(int i) {
  message msg;
  while (true) {
    receive(box, msg);
    /* critical section */;
    send(box, msg);
    /* remainder */;
  }
}
void main() {
  create_mailbox(box);
  send(box, null);
  parbegin(P(1), P(2), ..., P(n));
}
#+END_SRC

Bounded-buffer Producer/Consumer using Messages
#+BEGIN_SRC c
const int capacity = /* number of processes */;
int i;
void producer() {
  message pmsg;
  while (true) {
    receive(mayproduce, pmsg);
    pmsg = produce();
    send(mayconsume, pmsg);
  }
}
void consumer() {
  message cmsg;
  while (true) {
    receive(mayconsume, cmsg);
    consume();
    send(mayproduce, null);
  }
}
void main() {
  create_mailbox(mayproduce);
  create_mailbox(mayconsume);
  for (int i = 1; i <= capacity; i++) send(mayproduce, null);
  parbegin(producer, consumer);
}
#+END_SRC

* Readers/Writers Problem
Problem defined as follows: there is a data area shared among processes,
some of which only read and some of which only write.
The conditions on these are:
1. any number of readers may simultaneously read the file
2. only one writer at a time may write to the file
3. if a writer is writing to the file, no reader may read it

