3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.html
<div id="outline-container-org4f400aa" class="outline-2">
<h2 id="org4f400aa"><span class="section-number-2">7.</span> Message Passing</h2>
<div class="outline-text-2" id="text-7">
<p>
When processes interact, must ensure synchronization and communication.
Can be done with message passing, which has 2 primitives:
</p>
<ul class="org-ul">
<li><code>send(destination, message);</code></li>
<li><code>receive(source, message);</code></li>
</ul>

<p>
Sender and receiver can be blocking or nonblocking, of which there are
3 common combinations
</p>
<ol class="org-ol">
<li><b>blocking send, blocking receive</b>: both sender and receiver blocked
until message is delivered, allows for tight synchronization</li>
<li><b>nonblocking send, blocking receive</b>: sender may continue but
receiver is blocked until message arrives</li>
<li><b>nonblocking send, nonblocking receive</b>: neither party must wait</li>
</ol>

<p>
Nonblocking send is most natural since a sender can then send
multiple different messages.
Blocking receive is most natural since receivers generally expect
information before proceeding.
</p>
</div>
<div id="outline-container-orge1edfdb" class="outline-3">
<h3 id="orge1edfdb"><span class="section-number-3">7.1.</span> Addressing</h3>
<div class="outline-text-3" id="text-7-1">
<p>
With direct addressing
</p>
<ul class="org-ul">
<li>the <code>send</code> primitive includes a specific identifier</li>
</ul>
<p>
of the destination process.
</p>
<ul class="org-ul">
<li>the <code>receive</code> primitive either:
<ul class="org-ul">
<li>requires that the process explicitly designate a sending process</li>
<li>uses implicit addressing: the source possesses a value returned
when the receive has bene performed</li>
</ul></li>
</ul>

<p>
With indirect addressing
</p>
<ul class="org-ul">
<li>messages are sent to queue that holds messages, called mailbox</li>
<li>decoupling sender and receiver allows for more flexibility in
use of messages</li>
<li>relationship between senders and receivers can be:
<ul class="org-ul">
<li>one-to-one: private communication between two processes</li>
<li>many-to-one: client-server interaction, creates port</li>
<li>one-to-many: broadcasting to set of processes</li>
<li>many-to-many: multiple server processes to provide
concurrent service to multiple clients</li>
</ul></li>
<li>mailboxes owned by creating process (ex. port)</li>
</ul>
</div>
</div>
<div id="outline-container-org863a390" class="outline-3">
<h3 id="org863a390"><span class="section-number-3">7.2.</span> Message Format</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Message typically divided into header and body.
Header contains:
</p>
<ul class="org-ul">
<li>message type</li>
<li>destination ID</li>
<li>source ID</li>
<li>message length</li>
<li>control information</li>
</ul>

<p>
Body contains message contents.
</p>

<p>
Messages can be queued based on priority.
</p>
</div>
</div>
<div id="outline-container-org071e246" class="outline-3">
<h3 id="org071e246"><span class="section-number-3">7.3.</span> Mutual Exclusion</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Mutual Exclusion using Messages
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">n</span> = <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">number of processes</span><span style="color: #5B6268;"> */</span>;
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">P</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
  <span style="color: #ECBE7B;">message</span> <span style="color: #dcaeea;">msg</span>;
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    receive<span style="color: #98be65;">(</span>box, msg<span style="color: #98be65;">)</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">critical section</span><span style="color: #5B6268;"> */</span>;
    send<span style="color: #98be65;">(</span>box, msg<span style="color: #98be65;">)</span>;
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">remainder</span><span style="color: #5B6268;"> */</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  create_mailbox<span style="color: #c678dd;">(</span>box<span style="color: #c678dd;">)</span>;
  send<span style="color: #c678dd;">(</span>box, null<span style="color: #c678dd;">)</span>;
  parbegin<span style="color: #c678dd;">(</span>P<span style="color: #98be65;">(</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span>, P<span style="color: #98be65;">(</span><span style="color: #da8548; font-weight: bold;">2</span><span style="color: #98be65;">)</span>, ..., P<span style="color: #98be65;">(</span>n<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Bounded-buffer Producer/Consumer using Messages
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">capacity</span> = <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">number of processes</span><span style="color: #5B6268;"> */</span>;
<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span>;
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">producer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #ECBE7B;">message</span> <span style="color: #dcaeea;">pmsg</span>;
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    receive<span style="color: #98be65;">(</span>mayproduce, pmsg<span style="color: #98be65;">)</span>;
    pmsg = produce<span style="color: #98be65;">()</span>;
    send<span style="color: #98be65;">(</span>mayconsume, pmsg<span style="color: #98be65;">)</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">consumer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #ECBE7B;">message</span> <span style="color: #dcaeea;">cmsg</span>;
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    receive<span style="color: #98be65;">(</span>mayconsume, cmsg<span style="color: #98be65;">)</span>;
    consume<span style="color: #98be65;">()</span>;
    send<span style="color: #98be65;">(</span>mayproduce, null<span style="color: #98be65;">)</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  create_mailbox<span style="color: #c678dd;">(</span>mayproduce<span style="color: #c678dd;">)</span>;
  create_mailbox<span style="color: #c678dd;">(</span>mayconsume<span style="color: #c678dd;">)</span>;
  <span style="color: #51afef;">for</span> <span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = <span style="color: #da8548; font-weight: bold;">1</span>; i &lt;= capacity; i++<span style="color: #c678dd;">)</span> send<span style="color: #c678dd;">(</span>mayproduce, null<span style="color: #c678dd;">)</span>;
  parbegin<span style="color: #c678dd;">(</span>producer, consumer<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfcc4871" class="outline-2">
<h2 id="orgfcc4871"><span class="section-number-2">8.</span> Readers/Writers Problem</h2>
<div class="outline-text-2" id="text-8">
<p>
Problem defined as follows: there is a data area shared among processes,
some of which only read and some of which only write.
The conditions on these are:
</p>
<ol class="org-ol">
<li>any number of readers may simultaneously read the file</li>
<li>only one writer at a time may write to the file</li>
<li>if a writer is writing to the file, no reader may read it</li>
</ol>
</div>
