3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.tex
\section{Message Passing}
\label{sec:orge14721e}
When processes interact, must ensure synchronization and communication.
Can be done with message passing, which has 2 primitives:
\begin{itemize}
\item \texttt{send(destination, message);}
\item \texttt{receive(source, message);}
\end{itemize}

Sender and receiver can be blocking or nonblocking, of which there are
3 common combinations
\begin{enumerate}
\item \textbf{blocking send, blocking receive}: both sender and receiver blocked
until message is delivered, allows for tight synchronization
\item \textbf{nonblocking send, blocking receive}: sender may continue but
receiver is blocked until message arrives
\item \textbf{nonblocking send, nonblocking receive}: neither party must wait
\end{enumerate}

Nonblocking send is most natural since a sender can then send
multiple different messages.
Blocking receive is most natural since receivers generally expect
information before proceeding.
\subsection{Addressing}
\label{sec:orgcd9156f}
With direct addressing
\begin{itemize}
\item the \texttt{send} primitive includes a specific identifier
\end{itemize}
of the destination process.
\begin{itemize}
\item the \texttt{receive} primitive either:
\begin{itemize}
\item requires that the process explicitly designate a sending process
\item uses implicit addressing: the source possesses a value returned
when the receive has bene performed
\end{itemize}
\end{itemize}

With indirect addressing
\begin{itemize}
\item messages are sent to queue that holds messages, called mailbox
\item decoupling sender and receiver allows for more flexibility in
use of messages
\item relationship between senders and receivers can be:
\begin{itemize}
\item one-to-one: private communication between two processes
\item many-to-one: client-server interaction, creates port
\item one-to-many: broadcasting to set of processes
\item many-to-many: multiple server processes to provide
concurrent service to multiple clients
\end{itemize}
\item mailboxes owned by creating process (ex. port)
\end{itemize}
\subsection{Message Format}
\label{sec:org6e1a791}
Message typically divided into header and body.
Header contains:
\begin{itemize}
\item message type
\item destination ID
\item source ID
\item message length
\item control information
\end{itemize}

Body contains message contents.

Messages can be queued based on priority.
\subsection{Mutual Exclusion}
\label{sec:org199a74b}
Mutual Exclusion using Messages
\begin{verbatim}
const int n = /* number of processes */;
void P(int i) {
  message msg;
  while (true) {
    receive(box, msg);
    /* critical section */;
    send(box, msg);
    /* remainder */;
  }
}
void main() {
  create_mailbox(box);
  send(box, null);
  parbegin(P(1), P(2), ..., P(n));
}
\end{verbatim}

Bounded-buffer Producer/Consumer using Messages
\begin{verbatim}
const int capacity = /* number of processes */;
int i;
void producer() {
  message pmsg;
  while (true) {
    receive(mayproduce, pmsg);
    pmsg = produce();
    send(mayconsume, pmsg);
  }
}
void consumer() {
  message cmsg;
  while (true) {
    receive(mayconsume, cmsg);
    consume();
    send(mayproduce, null);
  }
}
void main() {
  create_mailbox(mayproduce);
  create_mailbox(mayconsume);
  for (int i = 1; i <= capacity; i++) send(mayproduce, null);
  parbegin(producer, consumer);
}
\end{verbatim}
\section{Readers/Writers Problem}
\label{sec:org4e4e189}
Problem defined as follows: there is a data area shared among processes,
some of which only read and some of which only write.
The conditions on these are:
\begin{enumerate}
\item any number of readers may simultaneously read the file
\item only one writer at a time may write to the file
\item if a writer is writing to the file, no reader may read it
\end{enumerate}
