3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.org
** Readers Have Priority
#+BEGIN_SRC c
int readcount;
semaphore x = 1, wsem = 1;

void reader() {
  while (true) {
    semWait(x);
    readcount++;
    if (readcount == 1) {
      semWait(wsem);
    }
    semSignal(x);
    READUNIT();
    semWait(x);
    readcount--;
    if (readcount == 0) {
      semSignal(wsem);
    }
    semSignal(x);
  }
}

void writer() {
  while (true) {
    semWait(wsem);
    WRITEUNIT();
    semSignal(wsem);
  }
}

void main() {
  readcount = 0;
  parbegin(reader, writer);
}
#+END_SRC

When one writer is writing, no other writer or reader can access
the shared data.

The first reader waits on ~wsem~ (in case of writing), subsequent
readers need not wait since first one guarantees no writing.

Last reader finishing up signals ~wsem~ that writing can occur as
no other readers accessing data.

** Writers Have Priority
Prevents writer starvation by guaranteeing no new readers once
at least one writer desires to write.

#+BEGIN_SRC c
int readcount, writecount;
semaphore x = 1, y = 1, z = 1, wsem = 1, rsem = 1;

void reader() {
  while (true) {
    semWait(z);
    semWait(rsem);
    semWait(x);
    readcount++;
    if (readcount == 1) {
      semWait(wsem);
    }
    semSignal(x);
    semSignal(rsem);
    semSignal(z);
    READUNIT();
    semWait(x);
    readcount--;
    if (readcount == 0) {
      semSignal(wsem);
    }
    semSignal(x);
  }
}

void writer() {
  while (true) {
    semWait(y);
    writecount++;
    if (writecount == 1) {
        semWait(rsem);
    }
    semSignal(y);
    semWait(wsem);
    WRITEUNIT();
    semSignal(wsem);
    semWait(y);
    writecount--;
    if (writecount == 0) {
        semSignal(rsem);
    }
    semSignal(y);
  }
}

void main() {
  readcount = 0;
  parbegin(reader, writer);
}
#+END_SRC
