3A/SE350/Concurrency-Mutual-Exclusion-and-Synchronization.html
<div id="outline-container-orgba12703" class="outline-3">
<h3 id="orgba12703"><span class="section-number-3">8.1.</span> Readers Have Priority</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">readcount</span>;
<span style="color: #ECBE7B;">semaphore</span> <span style="color: #dcaeea;">x</span> = <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">wsem</span> = <span style="color: #da8548; font-weight: bold;">1</span>;

<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">reader</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    semWait<span style="color: #98be65;">(</span>x<span style="color: #98be65;">)</span>;
    readcount++;
    <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>readcount == <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
      semWait<span style="color: #a9a1e1;">(</span>wsem<span style="color: #a9a1e1;">)</span>;
    <span style="color: #98be65;">}</span>
    semSignal<span style="color: #98be65;">(</span>x<span style="color: #98be65;">)</span>;
    <span style="color: #a9a1e1;">READUNIT</span><span style="color: #98be65;">()</span>;
    semWait<span style="color: #98be65;">(</span>x<span style="color: #98be65;">)</span>;
    readcount--;
    <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>readcount == <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
      semSignal<span style="color: #a9a1e1;">(</span>wsem<span style="color: #a9a1e1;">)</span>;
    <span style="color: #98be65;">}</span>
    semSignal<span style="color: #98be65;">(</span>x<span style="color: #98be65;">)</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>

<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">writer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    semWait<span style="color: #98be65;">(</span>wsem<span style="color: #98be65;">)</span>;
    <span style="color: #a9a1e1;">WRITEUNIT</span><span style="color: #98be65;">()</span>;
    semSignal<span style="color: #98be65;">(</span>wsem<span style="color: #98be65;">)</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>

<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  readcount = <span style="color: #da8548; font-weight: bold;">0</span>;
  parbegin<span style="color: #c678dd;">(</span>reader, writer<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
When one writer is writing, no other writer or reader can access
the shared data.
</p>

<p>
The first reader waits on <code>wsem</code> (in case of writing), subsequent
readers need not wait since first one guarantees no writing.
</p>

<p>
Last reader finishing up signals <code>wsem</code> that writing can occur as
no other readers accessing data.
</p>
</div>
</div>
<div id="outline-container-orgf9d0f37" class="outline-3">
<h3 id="orgf9d0f37"><span class="section-number-3">8.2.</span> Writers Have Priority</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Prevents writer starvation by guaranteeing no new readers once
at least one writer desires to write.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">readcount</span>, <span style="color: #dcaeea;">writecount</span>;
<span style="color: #ECBE7B;">semaphore</span> <span style="color: #dcaeea;">x</span> = <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">y</span> = <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">z</span> = <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">wsem</span> = <span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">rsem</span> = <span style="color: #da8548; font-weight: bold;">1</span>;

<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">reader</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    semWait<span style="color: #98be65;">(</span>z<span style="color: #98be65;">)</span>;
    semWait<span style="color: #98be65;">(</span>rsem<span style="color: #98be65;">)</span>;
    semWait<span style="color: #98be65;">(</span>x<span style="color: #98be65;">)</span>;
    readcount++;
    <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>readcount == <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
      semWait<span style="color: #a9a1e1;">(</span>wsem<span style="color: #a9a1e1;">)</span>;
    <span style="color: #98be65;">}</span>
    semSignal<span style="color: #98be65;">(</span>x<span style="color: #98be65;">)</span>;
    semSignal<span style="color: #98be65;">(</span>rsem<span style="color: #98be65;">)</span>;
    semSignal<span style="color: #98be65;">(</span>z<span style="color: #98be65;">)</span>;
    <span style="color: #a9a1e1;">READUNIT</span><span style="color: #98be65;">()</span>;
    semWait<span style="color: #98be65;">(</span>x<span style="color: #98be65;">)</span>;
    readcount--;
    <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>readcount == <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
      semSignal<span style="color: #a9a1e1;">(</span>wsem<span style="color: #a9a1e1;">)</span>;
    <span style="color: #98be65;">}</span>
    semSignal<span style="color: #98be65;">(</span>x<span style="color: #98be65;">)</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>

<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">writer</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  <span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">true</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    semWait<span style="color: #98be65;">(</span>y<span style="color: #98be65;">)</span>;
    writecount++;
    <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>writecount == <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
        semWait<span style="color: #a9a1e1;">(</span>rsem<span style="color: #a9a1e1;">)</span>;
    <span style="color: #98be65;">}</span>
    semSignal<span style="color: #98be65;">(</span>y<span style="color: #98be65;">)</span>;
    semWait<span style="color: #98be65;">(</span>wsem<span style="color: #98be65;">)</span>;
    <span style="color: #a9a1e1;">WRITEUNIT</span><span style="color: #98be65;">()</span>;
    semSignal<span style="color: #98be65;">(</span>wsem<span style="color: #98be65;">)</span>;
    semWait<span style="color: #98be65;">(</span>y<span style="color: #98be65;">)</span>;
    writecount--;
    <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>writecount == <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
        semSignal<span style="color: #a9a1e1;">(</span>rsem<span style="color: #a9a1e1;">)</span>;
    <span style="color: #98be65;">}</span>
    semSignal<span style="color: #98be65;">(</span>y<span style="color: #98be65;">)</span>;
  <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>

<span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
  readcount = <span style="color: #da8548; font-weight: bold;">0</span>;
  parbegin<span style="color: #c678dd;">(</span>reader, writer<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-19 Mon 19:20</p>
</div>
</body>
</html>
